class script(object):
    START_TXT = """<b> ʜᴇʏ ꜱᴡᴇᴇᴛʜᴇᴀʀᴛ.... {} 💖


ɪ'ᴍ ꜰɪʟᴇ ꜱᴇᴀʀᴄʜᴇʀ ʙᴏᴛ 🤫

ʜᴇʀᴇ ʏᴏᴜ ᴄᴀɴ ꜱᴇᴀʀᴄʜ ꜰɪʟᴇꜱ ɪɴ ᴏᴜʀ ʙᴏᴛ. ᴊᴜꜱᴛ ꜱᴛᴀʀᴛ ᴛʏᴘɪɴɢ....

ɪ ᴄᴀɴ ᴘʀᴏᴠɪᴅᴇ ᴍᴏᴠɪᴇꜱ ᴀɴᴅ ꜱᴇʀɪᴇꜱ ɪɴ ʙᴏᴛʜ ᴘᴍ ᴀɴᴅ ɢʀᴏᴜᴘ 🥱

ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴ ʙᴇʟᴏᴡ ᴛᴏ ᴀᴅᴅ ᴍᴇ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴀɴᴅ ᴇɴᴊᴏʏ ɴᴇᴡ ᴍᴏᴠɪᴇꜱ ᴡɪᴛʜ ʏᴏᴜʀ ꜰʀɪᴇɴᴅꜱ ᴀɴᴅ ꜰᴀᴍɪʟʏ ᴍᴇᴍʙᴇʀꜱ ❤️</b>

<b>ᴘᴏᴡᴇʀᴇᴅ ʙʏ</b> <a href='https://t.me/AM_FILMS'><b>@ᴀᴍ_ꜰɪʟᴍꜱ</b></a>"""

    HELP_TXT = """<b>⎙ ɪɴꜱᴛʀᴜᴄᴛɪᴏɴꜱ ⎙

ʜᴇʏ.....{}

ɪᴛ'ꜱ ᴛᴏᴏ ᴇᴀꜱʏ ᴛᴏ ᴜꜱᴇ ᴍᴇ 

⌾ ɴᴏᴛᴇ : ᴊᴜꜱᴛ ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴀꜱ ᴀᴅᴍɪɴ ᴀɴᴅ ꜱᴇɴᴅ ᴍᴏᴠɪᴇꜱ/ꜱᴇʀɪᴇꜱ ɴᴀᴍᴇ ɪ ᴡɪʟʟ ꜱᴇɴᴅ ɪᴛ ᴛᴏ ʏᴏᴜ ᴏʀ ᴀꜱᴋ ɪɴ ᴘᴍ

⌾ ɴᴏᴛᴇ : ᴛʜɪꜱ ᴡᴏʀᴋꜱ ᴏɴ ᴀɴʏ ᴄʜᴀᴛ ᴊᴜꜱᴛ ᴛʏᴘᴇ ᴛʜɪꜱ ʙᴏᴛ ᴜꜱᴇʀ ɴᴀᴍᴇ ᴀɴᴅ ᴛʜᴇɴ ʟᴇᴀᴠᴇ ᴀ ꜱᴘᴀᴄᴇ ᴀɴᴅ ꜱᴇᴀʀᴄʜ ᴀɴʏ ᴍᴏᴠɪᴇ ʏᴏᴜ ᴡᴀɴᴛ 


ᴘᴏᴡᴇʀᴇᴅ ʙʏ :  <a href='https://t.me/AM_FILMS'>@ᴀᴍ_ꜰɪʟᴍꜱ</a> </b>"""     
 


    ABOUT_TXT = """<b> ⌾ ᴍʏ ɴᴀᴍᴇ : {}
⌾ ᴄʀᴇᴀᴛᴏʀ : <a href='https://t.me/kichuxd'>ᴋɪᴄʜᴜ-[🍃⃝🦋][℡✧ ]</a>
⌾ ʟᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ 3
⌾ ʟɪʙʀᴀʀʏ : ᴘʏʀᴏɢʀᴀᴍ ᴀꜱʏɴᴄɪᴏ 0.17.1
⌾ ꜱᴇʀᴠᴇʀ : ʀᴇɴᴅᴇʀ 
⌾ ᴅᴀᴛᴀʙᴀꜱᴇ : ᴍᴏɴɢᴏᴅʙ 
⌾ ʙᴜɪʟᴅ ꜱᴛᴀᴛᴜꜱ : ᴠ1.0.2[ʙᴇᴛᴀ]
⌾ ꜱᴜᴘᴘᴏʀᴛ ɢʀᴏᴜᴘ : <a href='https://t.me/AM_FILMS'>@ᴀᴍ_ꜰɪʟᴍꜱ</a> </b>"""

    SOURCE_TXT = """<b>⎙ ꜱᴏᴜʀᴄᴇ ⎙
ꜱᴘᴇᴄɪᴀʟ ᴛʜᴀɴᴋꜱ ᴛᴏ ᴇᴠᴀᴍᴀʀɪᴀ ᴅᴇᴠꜱ ᴀɴᴅ ᴇᴠᴇʀʏᴏɴᴇ ɪɴ ᴛʜɪꜱ ᴊᴏᴜʀɴᴇʏ 

⌾ ᴏʀɪɢɪɴᴀʟ : <a href='https://github.com/ritheshrkrm/PiroAutoFilterBot'>ᴄʟɪᴄᴋ ʜᴇʀᴇ</a>
⌾ ᴇᴅɪᴛᴇᴅ : <a href='https://github.com/Kichuprobotzzz/Anya-Forger'>ᴄʟɪᴄᴋ ʜᴇʀᴇ</a> </b>""" #please don't change repo link give credit :)

    MANUELFILTER_TXT = """<b>⎙ ɪɴꜱᴛʀᴜᴄᴛɪᴏɴꜱ ⎙
- ꜰɪʟᴛᴇʀ ɪꜱ ᴀ ꜰᴇᴀᴛᴜʀᴇ ᴡᴇʀᴇ ᴜꜱᴇʀꜱ ᴄᴀɴ ꜱᴇᴛ ᴀᴜᴛᴏᴍᴀᴛᴇᴅ ʀᴇᴘʟɪᴇꜱ ꜰᴏʀ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴋᴇʏᴡᴏʀᴅ ᴀɴᴅ ɪ ᴡɪʟʟ ʀᴇꜱᴘᴏɴᴅ ᴡʜᴇɴᴇᴠᴇʀ ᴀ ᴋᴇʏᴡᴏʀᴅ ɪꜱ ꜰᴏᴜɴᴅ ɪɴ ᴛʜᴇ ᴍᴇꜱꜱᴀɢᴇ
ɴᴏᴛᴇ:
1. ᴛʜɪꜱ ʙᴏᴛ ꜱʜᴏᴜʟᴅ ʜᴀᴠᴇ ᴀᴅᴍɪɴ ᴘʀɪᴠɪʟᴇɢᴇ.
2. ᴏɴʟʏ ᴀᴅᴍɪɴꜱ ᴄᴀɴ ᴀᴅᴅ ꜰɪʟᴛᴇʀꜱ ɪɴ ᴀ ᴄʜᴀᴛ.
3. ᴀʟᴇʀᴛ ʙᴜᴛᴛᴏɴꜱ ʜᴀᴠᴇ ᴀ ʟɪᴍɪᴛ ᴏꜰ 64 ᴄʜᴀʀᴀᴄᴛᴇʀꜱ.

ᴄᴏᴍᴍᴀɴᴅꜱ ᴀɴᴅ ᴜꜱᴀɢᴇ</b>

⌾ /filter - <b>ᴀᴅᴅ ᴀ ꜰɪʟᴛᴇʀ ɪɴ ᴀ ᴄʜᴀᴛ</b>
⌾ /filters - <b>ʟɪꜱᴛ ᴀʟʟ ᴛʜᴇ ꜰɪʟᴛᴇʀꜱ ᴏꜰ ᴀ ᴄʜᴀᴛ</b>
⌾ /del - <b>ᴅᴇʟᴇᴛᴇ ᴀ ꜱᴘᴇᴄɪꜰɪᴄ ꜰɪʟᴛᴇʀ ɪɴ ᴀ ᴄʜᴀᴛ</b>
⌾ /delall - <b>ᴅᴇʟᴇᴛᴇ ᴛʜᴇ ᴡʜᴏʟᴇ ꜰɪʟᴛᴇʀꜱ ɪɴ ᴀ ᴄʜᴀᴛ (ᴄʜᴀᴛ ᴏᴡɴᴇʀ ᴏɴʟʏ)</b>"""

    BUTTON_TXT = """<b>⎙ ɪɴꜱᴛʀᴜᴄᴛɪᴏɴꜱ ⎙
- ᴛʜɪꜱ ʙᴏᴛ ꜱᴜᴘᴘᴏʀᴛꜱ ʙᴏᴛʜ ᴜʀʟ ᴀɴᴅ ᴀʟᴇʀᴛ ɪɴʟɪɴᴇ ʙᴜᴛᴛᴏɴꜱ.</b>
<b>ɴᴏᴛᴇ:</b>
<b>1. ᴛᴇʟᴇɢʀᴀᴍ ᴡɪʟʟ ɴᴏᴛ ᴀʟʟᴏᴡꜱ ʏᴏᴜ ᴛᴏ ꜱᴇɴᴅ ʙᴜᴛᴛᴏɴꜱ ᴡɪᴛʜᴏᴜᴛ ᴀɴʏ ᴄᴏɴᴛᴇɴᴛ, ꜱᴏ ᴄᴏɴᴛᴇɴᴛ ɪꜱ ᴍᴀɴᴅᴀᴛᴏʀʏ.
2. ᴛʜɪꜱ ʙᴏᴛ ꜱᴜᴘᴘᴏʀᴛꜱ ʙᴜᴛᴛᴏɴꜱ ᴡɪᴛʜ ᴀɴʏ ᴛᴇʟᴇɢʀᴀᴍ ᴍᴇᴅɪᴀ ᴛʏᴘᴇ.
3. ʙᴜᴛᴛᴏɴꜱ ꜱʜᴏᴜʟᴅ ʙᴇ ᴘʀᴏᴘᴇʀʟʏ ᴘᴀʀꜱᴇᴅ ᴀꜱ ᴍᴀʀᴋᴅᴏᴡɴ ꜰᴏʀᴍᴀᴛ</b>
<b>ᴜʀʟ ʙᴜᴛᴛᴏɴꜱ:</b>
<b>[Button Text](buttonurl:https://t.me/AM_FILMS)</b>
<b>ᴀʟᴇʀᴛ ʙᴜᴛᴛᴏɴꜱ:</b>
<b>[Button Text](buttonalert:ᴛʜɪꜱ ɪꜱ ᴀɴ ᴀʟᴇʀᴛ ᴍᴇꜱꜱᴀɢᴇ)</b>"""

    AUTOFILTER_TXT = """<b>⎙ ɪɴꜱᴛʀᴜᴄᴛɪᴏɴꜱ ⎙

⌾ ɴᴏᴛᴇ: Fɪʟᴇ Iɴᴅᴇx

1. ᴍᴀᴋᴇ ᴍᴇ ᴛʜᴇ ᴀᴅᴍɪɴ ᴏꜰ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ɪꜰ ɪᴛ'ꜱ ᴘʀɪᴠᴀᴛᴇ.
2. ᴍᴀᴋᴇ ꜱᴜʀᴇ ᴛʜᴀᴛ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ᴅᴏᴇꜱ ɴᴏᴛ ᴄᴏɴᴛᴀɪɴꜱ ᴄᴀᴍʀɪᴘꜱ, ᴘᴏʀɴ ᴀɴᴅ ꜰᴀᴋᴇ ꜰɪʟᴇꜱ.
3. ꜰᴏʀᴡᴀʀᴅ ᴛʜᴇ ʟᴀꜱᴛ ᴍᴇꜱꜱᴀɢᴇ ᴛᴏ ᴍᴇ ᴡɪᴛʜ Qᴜᴏᴛᴇꜱ. ɪ'ʟʟ ᴀᴅᴅ ᴀʟʟ ᴛʜᴇ ꜰɪʟᴇꜱ ɪɴ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ ᴛᴏ ᴍʏ ᴅʙ.

⌾ ɴᴏᴛᴇ: ᴀᴜᴛᴏꜰɪʟᴛᴇʀ

1. ᴀᴅᴅ ᴛʜᴇ ʙᴏᴛ ᴀs ᴀᴅᴍɪɴ ᴏɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ.</b>
2. <b>ᴜsᴇ</b> /connect <b>ᴀɴᴅ ᴄᴏɴɴᴇᴄᴛ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴛᴏ ᴛʜᴇ ʙᴏᴛ.</b>
3. <b>ᴜsᴇ<b> /settings <b>ᴏɴ ʙᴏᴛ's ᴘᴍ ᴀɴᴅ ᴛᴜʀɴ ᴏɴ ᴀᴜᴛᴏꜰɪʟᴛᴇʀ ᴏɴ ᴛʜᴇ sᴇᴛᴛɪɴɢs ᴍᴇɴᴜ.</b>"""

    CONNECTION_TXT = """<b>⎙ ɪɴꜱᴛʀᴜᴄᴛɪᴏɴꜱ ⎙

⌾ ᴜꜱᴇᴅ ᴛᴏ ᴄᴏɴɴᴇᴄᴛ ʙᴏᴛ ᴛᴏ ᴘᴍ ꜰᴏʀ ᴍᴀɴᴀɢɪɴɢ ꜰɪʟᴛᴇʀꜱ 
⌾ ɪᴛ ʜᴇʟᴘꜱ ᴛᴏ ᴀᴠᴏɪᴅ ꜱᴘᴀᴍᴍɪɴɢ ɪɴ ɢʀᴏᴜᴘꜱ.</b>
<b>ɴᴏᴛᴇ:
1. ᴏɴʟʏ ᴀᴅᴍɪɴꜱ ᴄᴀɴ ᴀᴅᴅ ᴀ ᴄᴏɴɴᴇᴄᴛɪᴏɴ.
2. ꜱᴇɴᴅ /ᴄᴏɴɴᴇᴄᴛ ꜰᴏʀ ᴄᴏɴɴᴇᴄᴛɪɴɢ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ᴘᴍ
ᴄᴏᴍᴍᴀɴᴅs ᴀɴᴅ ᴜsᴀɢᴇ:</b>
⌾ /connect  - <b>ᴄᴏɴɴᴇᴄᴛ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴄʜᴀᴛ ᴛᴏ ʏᴏᴜʀ ᴘᴍ</b>
⌾ /disconnect  - <b>ᴅɪꜱᴄᴏɴɴᴇᴄᴛ ꜰʀᴏᴍ ᴀ ᴄʜᴀᴛ</b>
⌾ /connections - <b>ʟɪꜱᴛ ᴀʟʟ ʏᴏᴜʀ ᴄᴏɴɴᴇᴄᴛɪᴏɴꜱ</b>"""

    EXTRAMOD_TXT = """<b>⎙ ɪɴꜱᴛʀᴜᴄᴛɪᴏɴꜱ ⎙

⌾ ɴᴏᴛᴇ: ᴇxᴛʀᴀᴍᴏᴅ
ᴛʜᴇꜱᴇ ᴀʀᴇ ᴛʜᴇ ᴇxᴛʀᴀ ꜰᴇᴀᴛᴜʀᴇꜱ ᴏꜰ ᴛʜɪꜱ ʙᴏᴛ
ᴄᴏᴍᴍᴀɴᴅs ᴀɴᴅ ᴜsᴀɢᴇ:</b>
 
⌾ /id - <b>ɢᴇᴛ ɪᴅ ᴏꜰ ᴀ ꜱᴘᴇᴄɪꜰɪᴇᴅ ᴜꜱᴇʀ.</b>
⌾  /info  - <b>ɢᴇᴛ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ ᴀʙᴏᴜᴛ ᴀ ᴜꜱᴇʀ.</b>
⌾  /imdb  - <b>ɢᴇᴛ ᴛʜᴇ ꜰɪʟᴍ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ ꜰʀᴏᴍ ɪᴍᴅʙ ꜱᴏᴜʀᴄᴇ.</b>
⌾  /search  - <b>ɢᴇᴛ ᴛʜᴇ ꜰɪʟᴍ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ ꜰʀᴏᴍ ᴠᴀʀɪᴏᴜꜱ ꜱᴏᴜʀᴄᴇꜱ.</b>"""

    ADMIN_TXT = """ʜᴇʟᴘ: Aᴅᴍɪɴ Mᴏᴅs
<b>ɴᴏᴛᴇ:</b>
Tʜɪs Mᴏᴅᴜʟᴇ Oɴʟʏ Wᴏʀᴋs Fᴏʀ Mʏ Aᴅᴍɪɴs
Cᴏᴍᴍᴀɴᴅs Aɴᴅ Usᴀɢᴇ:
• /logs - <code>ᴛᴏ ɢᴇᴛ ᴛʜᴇ ʀᴇᴄᴇɴᴛ ᴇʀʀᴏʀꜱ</code>
• /stats - <code>ᴛᴏ ɢᴇᴛ ꜱᴛᴀᴛᴜꜱ ᴏꜰ ꜰɪʟᴇꜱ ɪɴ ᴅʙ. [Tʜɪs Cᴏᴍᴍᴀɴᴅ Cᴀɴ Bᴇ Usᴇᴅ Bʏ Aɴʏᴏɴᴇ]</code>
• /delete - <code>ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴀ ꜱᴘᴇᴄɪꜰɪᴄ ꜰɪʟᴇ ꜰʀᴏᴍ ᴅʙ.</code>
• /users - <code>ᴛᴏ ɢᴇᴛ ʟɪꜱᴛ ᴏꜰ ᴍʏ ᴜꜱᴇʀꜱ ᴀɴᴅ ɪᴅꜱ.</code>
• /chats - <code>ᴛᴏ ɢᴇᴛ ʟɪꜱᴛ ᴏꜰ ᴍʏ ᴄʜᴀᴛꜱ ᴀɴᴅ ɪᴅꜱ</code>
• /leave  - <code>ᴛᴏ ʟᴇᴀᴠᴇ ꜰʀᴏᴍ ᴀ ᴄʜᴀᴛ.</code>
• /disable  -  <code>ᴛᴏ ᴅɪꜱᴀʙʟᴇ ᴀ ᴄʜᴀᴛ.</code>
• /ban  - <code>ᴛᴏ ʙᴀɴ ᴀ ᴜꜱᴇʀ.</code>
• /unban  - <code>ᴛᴏ ᴜɴʙᴀɴ ᴀ ᴜꜱᴇʀ.</code>
• /channel - <code>ᴛᴏ ɢᴇᴛ ʟɪꜱᴛ ᴏꜰ ᴛᴏᴛᴀʟ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴄʜᴀɴɴᴇʟꜱ</code>
• /broadcast - <code>ᴛᴏ ʙʀᴏᴀᴅᴄᴀꜱᴛ ᴀ ᴍᴇꜱꜱᴀɢᴇ ᴛᴏ ᴀʟʟ ᴜꜱᴇʀꜱ</code>
• /group_broadcast - <code>Tᴏ ʙʀᴏᴀᴅᴄᴀsᴛ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ᴄᴏɴɴᴇᴄᴛᴇᴅ ɢʀᴏᴜᴘs.</code>
• /gfilter - <code>ᴛᴏ ᴀᴅᴅ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀs</code>
• /gfilters - <code>ᴛᴏ ᴠɪᴇᴡ ʟɪsᴛ ᴏғ ᴀʟʟ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀs</code>
• /delg - <code>ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴀ sᴘᴇᴄɪғɪᴄ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀ</code>
• /request - <code>Tᴏ sᴇɴᴅ ᴀ Mᴏᴠɪᴇ/Sᴇʀɪᴇs ʀᴇᴏ̨ᴜᴇsᴛ ᴛᴏ ʙᴏᴛ ᴀᴅᴍɪɴs. Oɴʟʏ ᴡᴏʀᴋs ᴏɴ sᴜᴘᴘᴏʀᴛ ɢʀᴏᴜᴘ. [Tʜɪs Cᴏᴍᴍᴀɴᴅ Cᴀɴ Bᴇ Usᴇᴅ Bʏ Aɴʏᴏɴᴇ]</code>
• /delallg - <code>Tᴏ ᴅᴇʟᴇᴛᴇ ᴀʟʟ Gғɪʟᴛᴇʀs ғʀᴏᴍ ᴛʜᴇ ʙᴏᴛ's ᴅᴀᴛᴀʙᴀsᴇ.</code>
• /deletefiles - <code>Tᴏ ᴅᴇʟᴇᴛᴇ CᴀᴍRɪᴘ ᴀɴᴅ PʀᴇDVD Fɪʟᴇs ғʀᴏᴍ ᴛʜᴇ ʙᴏᴛ's ᴅᴀᴛᴀʙᴀsᴇ.</code>"""

    STATUS_TXT = """<b>⎙ ꜱᴛᴀᴛᴜꜱ ⎙
⌾ ᴛᴏᴛᴀʟ ꜰɪʟᴇꜱ : {}
⌾ ᴛᴏᴛᴀʟ ᴍᴇᴍʙᴇʀꜱ : {}
⌾ ᴛᴏᴛᴀʟ ᴄʜᴀᴛꜱ : {}
⌾ ᴜꜱᴇᴅ ꜱᴛᴏʀᴀɢᴇ : {}
⌾ ꜰʀᴇᴇ ꜱᴛᴏʀᴀɢᴇ : {}
⌾ ᴜᴘᴛɪᴍᴇ : {}

⌾ ᴘᴏᴡᴇʀᴇᴅ ʙʏ :  <a href='https://t.me/AM_FILMS'>@ᴀᴍ_ꜰɪʟᴍꜱ</a> </b>"""

    LOG_TEXT_G = """#NewGroup
𝖦𝗋𝗈𝗎𝗉 = {}(<code>{}</code>)
𝖳𝗈𝗍𝖺𝗅 𝖬𝖾𝗆𝖻𝖾𝗋𝗌 = <code>{}</code>
𝖠𝖽𝖽𝖾𝖽 𝖡𝗒 - {}"""

    LOG_TEXT_P = """#NewUser
𝖨𝖽 - <code>{}</code>
𝖭𝖺𝗆𝖾 - {}"""

    ALRT_TXT = """<b>⌾ ʜᴇʟʟᴏ {} ᴛʜɪꜱ ɪꜱ ɴᴏᴛ ʏᴏᴜʀ ʀᴇQᴜᴇꜱᴛ ʀᴇQᴜᴇꜱᴛ ʏᴏᴜʀꜱᴇʟꜰ....!!</b>"""

    OLD_ALRT_TXT = """
<b>⌾ ʜᴇʏ {} ᴛʜᴇꜱᴇ ʙᴜᴛᴛᴏɴꜱ ᴇxᴘɪʀᴇᴅ ᴘʟᴇᴀꜱᴇ ʀᴇQᴜᴇꜱᴛ ᴀɢᴀɪɴ...!!</b>"""

    CUDNT_FND = """<b>⌾ ɪ ᴄᴏᴜʟᴅɴ'ᴛ ꜰɪɴᴅ ᴀɴʏᴛʜɪɴɢ ʀᴇʟᴀᴛᴇᴅ ᴛᴏ ʏᴏᴜʀ ʀᴇQᴜᴇꜱᴛ ᴅᴏ ʏᴏᴜ ᴍᴇᴀɴ ᴀɴʏ ᴏɴᴇ ᴏꜰ ᴛʜᴇꜱᴇ ?</b>
"""

    I_CUDNT = """
<b>⌾ ɪ ᴄᴏᴜʟᴅɴ'ᴛ ꜰɪɴᴅ ᴀɴʏᴛʜɪɴɢ ʀᴇʟᴀᴛᴇᴅ ᴛᴏ ʏᴏᴜʀ ʀᴇQᴜᴇꜱᴛ ʀᴇᴘᴏʀᴛ ᴛᴏ ᴀᴅᴍɪɴꜱ <a href='https://t.me/AM_FILMS'>@ᴀᴍ_ꜰɪʟᴍꜱ</a>  </b>"""

    I_CUD_NT = """
<b>⌾ ɪ ᴄᴏᴜʟᴅɴ'ᴛ ꜰɪɴᴅ ᴀɴʏᴛʜɪɴɢ ʀᴇʟᴀᴛᴇᴅ ᴛᴏ ʏᴏᴜʀ ʀᴇQᴜᴇꜱᴛ ʀᴇᴘᴏʀᴛ ᴛᴏ ᴀᴅᴍɪɴꜱ <a href='https://t.me/AM_FILMS'>@ᴀᴍ_ꜰɪʟᴍꜱ</a>  </b>"""

    MVE_NT_FND = """
<b>⌾ ɪ ᴄᴏᴜʟᴅɴ'ᴛ ꜰɪɴᴅ ᴀɴʏᴛʜɪɴɢ ʀᴇʟᴀᴛᴇᴅ ᴛᴏ ʏᴏᴜʀ ʀᴇQᴜᴇꜱᴛ ʀᴇᴘᴏʀᴛ ᴛᴏ ᴀᴅᴍɪɴꜱ <a href='https://t.me/AM_FILMS'>@ᴀᴍ_ꜰɪʟᴍꜱ</a>  </b>"""

    TOP_ALRT_MSG = """**⌾ ᴄʜᴇᴄᴋɪɴɢ ꜰᴏʀ Qᴜᴇʀʏ ɪɴ ᴍʏ ᴅᴀᴛᴀʙᴀꜱᴇ......⟳**"""

    MELCOW_ENG = """<b>Hey {}, Welcome to {}</b> 

• 𝖭𝗈 𝖯𝗋𝗈𝗆𝗈, 𝖭𝗈 𝖯𝗈𝗋𝗇, 𝖭𝗈 𝖮𝗍𝗁𝖾𝗋 𝖠𝖻𝗎𝗌𝖾𝗌 😎 
• 𝖠𝗌𝗄 𝖸𝗈𝗎𝗋 𝖬𝗈𝗏𝗂𝖾𝗌 𝖶𝗂𝗍𝗁 𝖢𝗈𝗋𝗋𝖾𝖼𝗍 𝖲𝗉𝖾𝗅𝗅𝗂𝗇𝗀 ❤️ 
• 𝖲𝗉𝖺𝗆𝗆𝖾𝗋𝗌 𝖲𝗍𝖺𝗒 𝖠𝗐𝖺𝗒 😒 
• 𝖥𝖾𝖾𝗅 𝖥𝗋𝖾𝖾 𝖳𝗈 𝖱𝖾𝗉𝗈𝗋𝗍 𝖠𝗇𝗒 𝖤𝗋𝗋𝗈𝗋𝗌 𝖳𝗈 𝖠𝖽𝗆𝗂𝗇𝗌 𝗎𝗌𝗂𝗇𝗀 🤭 @admin

<u>𝗥𝗲𝗾𝘂𝗲𝘀𝘁𝘀 𝗙𝗼𝗿𝗺𝗮𝘁𝘀</u>

• 𝖲𝗈𝗅𝗈 2017
• 𝖣𝗁𝗈𝗈𝗆 3 𝖧𝗂𝗇
• 𝖪𝗎𝗋𝗎𝗉 𝖪𝖺𝗇
• 𝖣𝖺𝗋𝗄 𝗌01
• 𝖲𝗁𝖾 𝖧𝗎𝗅𝗄 720𝗉
• 𝖥𝗋𝗂𝖾𝗇𝖽𝗌 𝗌03 1080𝗉

‼️𝗗𝗼𝗻𝘁 𝗮𝗱𝗱 𝘄𝗼𝗿𝗱𝘀 & 𝘀𝘆𝗺𝗯𝗼𝗹𝘀 𝗹𝗶𝗸𝗲 , . -  send link movie series 𝗲𝘁𝗰‼️"""

    OWNER_INFO = """<b>⎙ ᴅɪꜱᴄʟᴀɪᴍᴇʀ ⎙

ᴍᴇᴅɪᴀ ᴀᴠᴀɪʟᴀʙʟᴇ ᴏᴠᴇʀ ᴏᴜʀ ʙᴏᴛ ɪꜱ ɴᴏᴛ ᴏᴡɴᴇᴅ ʙʏ ᴜꜱ ᴀɴᴅ ᴜᴘʟᴏᴀᴅᴇᴅ ᴏᴠᴇʀ ᴛʜᴇ ɪɴᴛᴇʀɴᴇᴛ ʙʏ ꜱᴏᴍᴇᴏɴᴇ ᴇʟꜱᴇ. ᴛʜɪꜱ ʙᴏᴛ ᴊᴜꜱᴛ ɪɴᴅᴇx ᴛʜᴏꜱᴇ ꜰɪʟᴇꜱ ꜰᴏʀ ᴇᴀꜱʏ ꜱᴇᴀʀᴄʜ ʙʏ ᴛʜᴇ ᴜꜱᴇʀꜱ. ᴡᴇ ʀᴇꜱᴘᴇᴄᴛ ᴀʟʟ ᴄᴏᴘʏʀɪɢʜᴛ ʟᴀᴡꜱ,ɪꜰ ʏᴏᴜ ʜᴀᴠᴇ ᴀɴʏ ᴄᴏᴍᴘʟᴀɪɴᴛ ᴀʙᴏᴜᴛ ᴀɴʏ ᴄᴏɴᴛᴇɴᴛ ᴀᴠᴀɪʟᴀʙʟᴇ ɪɴ ᴛʜɪꜱ ʙᴏᴛ ᴘʟᴇᴀꜱᴇ ɪɴꜰᴏʀᴍ ᴛʜᴇ ᴄʀᴇᴀᴛᴏʀ ᴏꜰ ᴛʜᴇ ʙᴏᴛ ᴡᴇ ᴡɪʟʟ ʀᴇᴍᴏᴠᴇ ɪᴛ ᴀꜱᴀᴘ
ʙʏ <a href='https://t.me/AM_FILMS'>@ᴀᴍ_ꜰɪʟᴍꜱ</a>

⌾ ᴄʀᴇᴀᴛᴏʀ : <a href='https://t.me/kichuxd'>ᴋɪᴄʜᴜ-[🍃⃝🦋][℡✧ ]</a>

⌾ ꜱᴜᴘᴘᴏʀᴛ ɢʀᴏᴜᴘ :  <a href='https://t.me/AM_FILMS'>@ᴀᴍ_ꜰɪʟᴍꜱ</a> </b>"""

    NORSLTS = """
#NoResults 

ID <b>: {}</b>

Name <b>: {}</b>

Message <b>: {}</b>"""

    CAPTION = """
📂 <em>File Name</em>: <code>CKFLICKS|{file_name}</code> 

🖇 <em>File Size</em>: <code>{file_size}</code> 

❤️‍🔥 </i>Join</i> [ADHOLOKAM](https://t.me/AM_FILMS)  

🖥 <i>Requests</i> - ||@raixpiro_bot|| """

    IMDB_TEMPLATE_TXT = """<b>⌾ ᴛɪᴛʟᴇ : {title}
⌾ ɢᴇɴʀᴇꜱ : {genres}
⌾ ʀᴀᴛɪɴɢ : {rating}
⌾ ʟᴀɴɢᴜᴀɢᴇ : {languages}
⌾ ʀᴜɴ ᴛɪᴍᴇ : {runtime}
⌾ ʀᴇʟᴇᴀꜱᴇ ɪɴꜰᴏ : {year}
⌾ ᴄᴇɴᴛᴜʀɪᴇꜱ : {countries}

⌾ ᴘᴏᴡᴇʀᴇᴅ ʙʏ : <a href='https://t.me/AM_FILMS'>@ᴀᴍ_ꜰɪʟᴍꜱ</a>  </b>"""
    
    ALL_FILTERS = """
<b>ʜᴇʏ {}, ᴛʜᴇꜱᴇ ᴀʀᴇ ᴛʜᴇ ᴛʜʀᴇᴇ ꜰɪʟᴛᴇʀ ᴏᴘᴛɪᴏɴꜱ ɪ ʜᴀᴠᴇ</b>"""
    
    GFILTER_TXT = """<b>⎙ ɪɴꜱᴛʀᴜᴄᴛɪᴏɴꜱ ⎙

ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ ɢʟᴏʙᴀʟ ꜰɪʟᴛᴇʀꜱ. ɢʟᴏʙᴀʟ ꜰɪʟᴛᴇʀꜱ ᴀʀᴇ ᴛʜᴇ ꜰɪʟᴛᴇʀꜱ ꜱᴇᴛ ʙʏ ʙᴏᴛ ᴀᴅᴍɪɴꜱ ᴡʜɪᴄʜ ᴡɪʟʟ ᴡᴏʀᴋ ᴏɴ ᴀʟʟ ɢʀᴏᴜᴘ 

ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅꜱ</b>

⌾ /gfilter - <b>Tᴏ ᴄʀᴇᴀᴛᴇ ᴀ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀ.</b>
⌾ /gfilters - <b>Tᴏ ᴠɪᴇᴡ ᴀʟʟ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀs.</b>
⌾ /delg - <b>Tᴏ ᴅᴇʟᴇᴛᴇ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀ.</b>
⌾ /delallg - <b>ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴀʟʟ ɢʟᴏʙᴀʟ ꜰɪʟᴛᴇʀꜱ</b>"""
    
    FILE_STORE_TXT = """<b>⎙ ɪɴꜱᴛʀᴜᴄᴛɪᴏɴꜱ ⎙

⌾ ꜰɪʟᴇ ꜱᴛᴏʀᴇ ɪꜱ ᴛʜᴇ ꜰᴇᴀᴛᴜʀᴇ ᴡʜɪᴄʜ ᴡɪʟʟ ᴄʀᴇᴀᴛᴇ ᴀ ꜱʜᴀʀᴀʙʟᴇ ʟɪɴᴋ ᴏꜰ ᴀ ꜱɪɴɢʟᴇ ᴏʀ ᴍᴜʟᴛɪᴘʟᴇ ꜰɪʟᴇꜱ

ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅs: </b>
⌾ /batch - <b>ᴛᴏ ᴄʀᴇᴀᴛᴇ ᴀ ʙᴀᴛᴄʜ ʟɪɴᴋ ᴏғ ᴍᴜʟᴛɪᴘʟᴇ ғɪʟᴇs.</b>
⌾ /link - <b>ᴛᴏ ᴄʀᴇᴀᴛᴇ ᴀ sɪɴɢʟᴇ ғɪʟᴇ sᴛᴏʀᴇ ʟɪɴᴋ.</b>
⌾ /pbatch - <b>Jᴜsᴛ ʟɪᴋᴇ /batch, ʙᴜᴛ ᴛʜᴇ ғɪʟᴇs ᴡɪʟʟ ʙᴇ sᴇɴᴅ ᴡɪᴛʜ ғᴏʀᴡᴀʀᴅ ʀᴇsᴛʀɪᴄᴛɪᴏɴs.</b>
⌾ /plink - <b>Jᴜsᴛ ʟɪᴋᴇ /link, ʙᴜᴛ ᴛʜᴇ ғɪʟᴇ ᴡɪʟʟ ʙᴇ sᴇɴᴅ ᴡɪᴛʜ ғᴏʀᴡᴀʀᴅ ʀᴇsᴛʀɪᴄᴛɪᴏɴ.</b>"""

    RESTART_TXT = """
<b>𝖡𝗈𝗍 𝖱𝖾𝗌𝗍𝖺𝗋𝗍𝖾𝖽 !</b>

📅 𝖣𝖺𝗍𝖾 : <code>{}</code>
⏰ 𝖳𝗂𝗆𝖾 : <code>{}</code>
🌐 𝖳𝗂𝗆𝖾𝗓𝗈𝗇𝖾 : <code>Asia/Kolkata</code>
🛠️ 𝖡𝗎𝗂𝗅𝖽 𝖲𝗍𝖺𝗍𝗎𝗌 : <code>𝗏2.7.3 [ 𝖲𝗍𝖺𝖻𝗅𝖾 ]</code></b>"""

    LOGO = """
PIRO BOTS"""
